# Modern Terminal Configuration - Brewfile
# Install with: brew bundle --file=Brewfile

# Terminal multiplexer
brew "tmux"

# Fuzzy finder (Ctrl+R history, file search)
brew "fzf"

# Modern CLI replacements
brew "eza"        # ls replacement with icons, git status, colors
brew "bat"        # cat replacement with syntax highlighting
brew "fd"         # find replacement, faster and friendlier
brew "ripgrep"    # grep replacement, blazing fast
brew "zoxide"     # cd replacement with frecency-based directory jumping
brew "git-delta"  # Better git diffs with syntax highlighting

# Prompt theme
brew "powerlevel10k"            # Feature-rich zsh prompt with instant prompt support

# Zsh plugins
brew "zsh-syntax-highlighting"  # Colors commands as you type
brew "zsh-autosuggestions"      # Ghost-text completions from history
brew "zsh-completions"          # Additional completion definitions

# AI coding assistant
brew "opencode"

# AWS CLI (for Bedrock provider authentication via SSO)
brew "awscli"

# Nerd Font (for icons in eza, p10k, etc.)
cask "font-meslo-lg-nerd-font"
